/*
 ============================================================================
 Name        : ckadai45.c
 Author      : kagaya
 Version     :
 Copyright   : Your copyright notice
 Description : Hello World in C, Ansi-style
 ============================================================================
 */

/* ヘッダファイル -------------------------------------------------------- */
#include <stdio.h>
/* プロトタイプ宣言 ------------------------------------------------------ */
int Get_Data(int min, int max, char *in_str, char *err_str);
/* エントリポイント テスト用 -------------------------------------------- */
int main(void)
{
int mm, dd;
mm = Get_Data( 1, 12, "月を入力:",
"月の入力は「1 以上 12 以下」にしてください");
dd = Get_Data( 1, 31, "日を入力:",
"日の入力は「1 以上 31 以下」にしてください");
printf("入力された日付は「%d 月%d 日」です\n", mm, dd);
return 0;
}
/* ----------------------------------------------------------------------- */
/*
課題 45(Get_Data 関数のコメントもしっかり記述すること)
*/
/* ----------------------------------------------------------------------- */
int Get_Data(int min, int max, char *in_str, char *err_str)
{

}
